# Introduction to Pandas

Pandas is a high-level data manipulation package which was built on top of Numpy. The key structures within pandas include Series and Dataframes

## Series

A Series is a one-dimensional array with axis labels (an index)

In [2]:
# Importing libraries and packages
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# Creating a Series from a list
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
# We can access different components seperately:

# Accessing the index
x.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
# Accessing values
x.values

array([10, 20, 30, 40, 50])

In [6]:
# Acccessing the dtype
# A Series is a ndarray, thus it is homogenous and CANNOT store multiple dtypes
x.dtype

dtype('int64')

In [7]:
# Creating a Series with an Index
data = [450, 650, 870]
sales = Series(data, index = ["Don", "Mike", "Edwin"])
sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [8]:
# Check the type
type(sales)

pandas.core.series.Series

In [9]:
# If we check the index of sales, we will get the values, rather than the range
sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

In [10]:
sales["Don"]

np.int64(450)

In [11]:
sales[0]

C:\Users\memer\AppData\Local\Temp\ipykernel_58576\1101347017.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales[0]

np.int64(450)

### Checking for conditions

In [12]:
# You can filter based on conditions
sales>500
# This will usually return booleans

Don      False
Mike      True
Edwin     True
dtype: bool

In [13]:
# We can use these booleans
sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [14]:
# If we want to see values greater than 500, we can use those booleans
sales[sales>500]

Mike     650
Edwin    870
dtype: int64

In [15]:
# Checking the names in the index
"Don" in sales

True

In [16]:
# False example
"Sally" in sales

False

In [17]:
# What about this
450 in sales
# 450 is not an index, it is a value

False

## Working with Dictionaries

In [18]:
# Converting a Series to a Dictionary
sales_dict = sales.to_dict()
sales_dict
# The indexes become the dictionary keys

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [19]:
# Converting a dictionary to a Series
sales_ser = Series(sales_dict)
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

## Adding entries and working with Nan/null values

In [20]:
# We can create a new Series from an existing Series
# If we specify names in the index that were NOT there already, NaN values will be assigned
new_sales = Series(sales, index = ["Don", "Mike", "Sally", "Edwin", "Lucy"])
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
Lucy       NaN
dtype: float64

In [21]:
# We can check if there are any NaN values in a Series
# For this we can use Numpy
np.isnan(new_sales)
# Shows True for any NaN values

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [22]:
# To check for null values, use Pandas
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

## Naming components in a Series

In [23]:
# Name an index
sales.index.name = "Sales Person"
sales

Sales Person
Don      450
Mike     650
Edwin    870
dtype: int64

In [24]:
# Name a Series
sales.name = "Total TV Sales"
sales

Sales Person
Don      450
Mike     650
Edwin    870
Name: Total TV Sales, dtype: int64

# DataFrames

DataFrame are two-dimensional, size-mutable, potentially heterogeneous tabular data structures. This data structure contains TWO labelled axes (rows and columns)

## Creating a DataFrame

In [25]:
# Creating a DataFrame from a list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

# When we create a DataFrame, we can specify what the column names are and the data type is
df = pd.DataFrame(data, columns = ["Name", "Age"])
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

## Creating a DataFrame from a Dictionary

In [27]:
# Create an example dictionary
dictionary = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

# Can use pd.DataFrame and pandas knows to use the keys as columns and the values as entries
df_dict = pd.DataFrame(dictionary)
df_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

## Adding custom indexes for DataFrames

In [31]:
# Adding custom indexes can be done via the index parameter in the DataFrame method

# It can be done from DataFrame creation:
df_dict = pd.DataFrame(dictionary, index = ['ID1', 'ID2', 'ID3'])
print(df_dict)

# Or it can be done by using the .index method
df_dict.index = ['id1', 'id2', 'id3']
print(df_dict)

        Name  Age         City
ID1    Alice   25     New York
ID2      Bob   30  Los Angeles
ID3  Charlie   35      Chicago
        Name  Age         City
id1    Alice   25     New York
id2      Bob   30  Los Angeles
id3  Charlie   35      Chicago

## Creating DataFrames from a list of Dictionaries

In [32]:
# Using the same data as before to create a list of dictionaries
dict_list = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}
]
# You can create a DataFrame by simply putting this through pd.DataFrame
dict_list_df = pd.DataFrame(dict_list)
dict_list_df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

## Creating DataFrames from a Series

In [48]:
# Creating a DataFrame from a Series is simple
# First create a Series
s = pd.Series(['Alice', 'Bob', 'Charlie'], name='Name')

# Then create the DataFrame
df_series = pd.DataFrame(s)
df_series

# This returns a single column. A Series is basically a single column DataFrame

      Name
0    Alice
1      Bob
2  Charlie

## Adding a Series to a DataFrame

In [49]:
# Adding a Series to a DataFrame is equivalent to adding a column

new_col = pd.Series([25, 30, 35], name = 'Age')

# We can now add this Series to the DataFrame
df_series['Age'] = new_col
df_series

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

## Changing/Shifting the index of a DataFrame

In [50]:
# To change the index to a column one can use:
df_series = df_series.set_index('Name')
df_series
# This changes the index to the Name column

         Age
Name
Alice     25
Bob       30
Charlie   35

In [51]:
# You can also shift the index a number of steps
df_series = df_series.shift(1)
df_series
# This shifted the index downwards by 1, making the top row have a NaN entry

          Age
Name
Alice     NaN
Bob      25.0
Charlie  30.0

## How to fill missing values in a DataFrame?

In [57]:
# You can fill all NaN values with a specific value
missing = {
    'Name': ['Alice', 'Bob', 'Charlie', None],
    'Age': [25, 30, None, 40],
    'City': ['New York', None, 'Chicago', 'San Francisco']
}

df_missing = pd.DataFrame(missing)

df_filled = df_missing.fillna('Unknown')

df_filled

      Name      Age           City
0    Alice     25.0       New York
1      Bob     30.0        Unknown
2  Charlie  Unknown        Chicago
3  Unknown     40.0  San Francisco

### What if we don't want to fill all NaN with the same value?

In [59]:
# You can also fill in missing values using the value from the previous or next row
df_filled = df_missing.ffill() # Fills the missing values with the previous row's value
df_filled

      Name   Age           City
0    Alice  25.0       New York
1      Bob  30.0       New York
2  Charlie  30.0        Chicago
3  Charlie  40.0  San Francisco

In [60]:
df_filled = df_missing.bfill() # Fills the missing values with the next row's value
df_filled

      Name   Age           City
0    Alice  25.0       New York
1      Bob  30.0        Chicago
2  Charlie  40.0        Chicago
3     None  40.0  San Francisco

### What is .interpolate()?

In [64]:
# Interpolate is a method that allows for filling missing values by interpolating between existing ones
# A variety of methods are supported, like linear, polynomial interpolation

interpolate = {
    'A': [1, 2, None, 4],
    'B': [None, 2, 3, None]
}
df_inter = pd.DataFrame(interpolate)

df_interpolated = df_inter.interpolate(method='linear')

df_interpolated

# This uses linear interpolation
# The first value in the B column does not get interpolated as there is no previous data to interpolate from

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  4.0  3.0

## How to drop values from a DataFrame?

In [101]:
# You can drop values in a dataframe using the .drop() method

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'San Francisco']
}
df = pd.DataFrame(data)

df.index

RangeIndex(start=0, stop=4, step=1)

### Dropping by column name

In [102]:
# You can drop by column name
df_dropped = df.drop(columns=['City'])
df_dropped

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

### Dropping by row index

In [103]:
# You can also drop rows by referring to their index

df_dropped = df.drop(index=1) # Here we delete Bob
df_dropped

      Name  Age           City
0    Alice   25       New York
2  Charlie   35        Chicago
3    David   40  San Francisco

### Dropping rows based on a threshold/condition

In [104]:
df_dropped = df[df['Age'] <= 30] # Here we drop any rows that are Age > 30
df_dropped

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [110]:
# You can also filter based on multiple conditions with logic operators between
df_dropped = df[((df['Age'] < 30) & (df['City'] != 'Chicago'))] # Here we drop any rows that are >= 30 and are from Chicago
df_dropped

    Name  Age      City
0  Alice   25  New York

## Duplicate Rows

### How to delete duplicate rows

In [4]:
# We can create a DataFrame with duplicate rows
data = {
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob', 'David'],
    'Age': [25, 30, 25, 35, 30, 40],
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'San Francisco']
}

df = pd.DataFrame(data)

# To drop duplicate rows we use the following method:

df_unique = df.drop_duplicates()

df_unique

      Name  Age           City
0    Alice   25       New York
1      Bob   30    Los Angeles
3  Charlie   35        Chicago
5    David   40  San Francisco

## Finding duplicate rows

In [7]:
# We can use the same DataFrame as before

# To find duplicate rows we can use the .duplicated() method

duplicates = df.duplicated()
duplicates # This a Series of boolean values, which indicates whether a row is a duplicate or not

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

## Selecting columns

In [8]:
# To select an entire column in a DataFrame you can use ['column_name'] with the column name

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# To select the Age column:
age_column = df['Age']
age_column # This returns a Series

0    25
1    30
2    35
Name: Age, dtype: int64

In [11]:
# You can also keep the column as a DataFrame rather than a Series using double square brackets [['column_name']]

# To select the Age column:
age_df = df[['Age']]
age_df # This returns a DataFrame

   Age
0   25
1   30
2   35

In [12]:
# To select multiple columns you just list them within double brackets

# To select the Name and Age column:
name_age_df = df[['Name', 'Age']]
name_age_df # This returns a DataFrame

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### What is iloc and loc?

#### iloc

In [14]:
# iloc is a method of selecting rows and columns by position based indexing using integers
# Using the previous DataFrame to showcase this:

df.iloc[1] # This prints the 2nd row of the dataframe

Name            Bob
Age              30
City    Los Angeles
Name: 1, dtype: object

In [16]:
# You can also select multiple rows using iloc:
df.iloc[[0, 2]] # This returns the first and third rows of the DataFrame

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [18]:
# To select a column:
df.iloc[:, 1] # This selects the second column (Age in this case)

0    25
1    30
2    35
Name: Age, dtype: int64

In [19]:
# Finally, you can also select multiple rows and columns
df.iloc[[0, 2], [0, 2]] # This selects the first and third row, with the first and third column

      Name      City
0    Alice  New York
2  Charlie   Chicago

#### loc

In [22]:
# loc is used for label-based indexing (column names or index labels)
df = pd.DataFrame(data, index=['A', 'B', 'C']) # Here we give index labels to the DataFrame

df.loc['B'] # Here we select the row with index 'B'

Name            Bob
Age              30
City    Los Angeles
Name: B, dtype: object

In [23]:
# Similar to iloc, you can select multiple rows using double square brackets

df.loc[['A', 'C']] # Selects rows with index 'A' and 'C'

      Name  Age      City
A    Alice   25  New York
C  Charlie   35   Chicago

In [24]:
# To select columns we use the same technique as iloc:
df.loc[:, 'Age'] # Returns the 'Age' column

# Selecting individual rows and columns works the same way as iloc but with row index labels and column names instead of positions

A    25
B    30
C    35
Name: Age, dtype: int64

In [27]:
# You can also utilise boolean conditions with loc, unlike iloc

df.loc[df['Age'] > 25] # This selects the rows with Age > 25

      Name  Age         City
B      Bob   30  Los Angeles
C  Charlie   35      Chicago

## Filtering

In [29]:
df = pd.DataFrame(data)

# To filter on a single column based on a condition we can:
df_filtered = df[df['Age'] > 30] # This selects rows where Age > 30
df_filtered

      Name  Age     City
2  Charlie   35  Chicago

In [31]:
# You can also filter based on multiple conditions
df_filtered = df[(df['Age'] > 30) & (df['City'] == 'Chicago')] # This selects rows where Age > 30 and City = Chicago
df_filtered

      Name  Age     City
2  Charlie   35  Chicago

In [32]:
# You can also use the OR logic condition using '|'
df_filtered = df[(df['Age'] > 30) | (df['City'] == 'Los Angeles')] # This selects rows where Age > 30 OR City = Los Angeles
df_filtered

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

## Sorting and Ranking data

### Sorting

In [33]:
# We will create a new DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [35, 25, 40, 30],
    'Salary': [70000, 50000, 120000, 90000]
}
df = pd.DataFrame(data)

In [35]:
# To sort by Age (in descending order)
df_sorted = df.sort_values(by='Age', ascending = False)
df_sorted

      Name  Age  Salary
2  Charlie   40  120000
0    Alice   35   70000
3    David   30   90000
1      Bob   25   50000

In [37]:
# You can also sort by multiple columns:
df_sorted = df.sort_values(by=['Age', 'Salary']) # Sorts on Age and Salary
df_sorted

      Name  Age  Salary
1      Bob   25   50000
3    David   30   90000
0    Alice   35   70000
2  Charlie   40  120000

In [40]:
# You can also sort by index using df.sort_index()
df.sort_index(ascending = False) # Here we sort by index in descending order

      Name  Age  Salary
3    David   30   90000
2  Charlie   40  120000
1      Bob   25   50000
0    Alice   35   70000

### Ranking

The `.rank()` method will assign a rank position to each value in a column

In [45]:
df['Rank'] = df['Salary'].rank(ascending = False) # Creates a column of ranks based on Salary
df # The lowest salary gets rank 4 and the highest gets rank 1 because we use "ascending = False"

      Name  Age  Salary  Rank
0    Alice   35   70000   3.0
1      Bob   25   50000   4.0
2  Charlie   40  120000   1.0
3    David   30   90000   2.0

In [47]:
# Can also use the method parameter in .rank() to control how ties are handles
df['Rank_Avg'] = df['Salary'].rank(method='average') # If multiple values are tied, then they get average rank

df['Rank_Max'] = df['Salary'].rank(method='max') # Tied values will get the highest rank allocated

## The .describe() method

The `.describe()` method is used to provide a statistical summary of the data in the DataFrame.

In [50]:
# Using the same data as the previous section:
df = pd.DataFrame(data)
df.describe() # Shows a variety of summary statistics about age and salary

             Age         Salary
count   4.000000       4.000000
mean   32.500000   82500.000000
std     6.454972   29860.788112
min    25.000000   50000.000000
25%    28.750000   65000.000000
50%    32.500000   80000.000000
75%    36.250000   97500.000000
max    40.000000  120000.000000

In [61]:
# Other summary statistics that are not in .describe() are:

df.median(numeric_only=True) # The median

df.std(numeric_only=True) # Standard deviation

df.var(numeric_only=True) # Variance

Age       4.166667e+01
Salary    8.916667e+08
dtype: float64

## Hierarchical Indexes

Hierarchical indexing is when you have more than one level of indexes for rows in a DataFrame. A DataFrame with hierarchical indexing is called a MultiIndex DataFrame.

In [62]:
# To create a MultiIndex DataFrame we start by creating lists of indexes
index_lists = [
    ['USA', 'USA', 'USA', 'Canada', 'Canada', 'Canada'],
    ['New York', 'Chicago', 'Los Angeles', 'Toronto', 'Vancouver', 'Montreal']
]
# Here we have Cities in USA and Canada, with USA appearing every time for a US city

In [64]:
# To create the MultiIndex DataFrame we use:
index = pd.MultiIndex.from_tuples(list(zip(*index_lists)), names=['Country', 'City'])

In [66]:
data = {
    'Population': [8500000, 2700000, 4000000, 3000000, 2500000, 1800000],
    'GDP': [1.7, 0.7, 1.1, 0.5, 0.4, 0.3]
}

df = pd.DataFrame(data, index=index)
df

                     Population  GDP
Country City
USA     New York        8500000  1.7
        Chicago         2700000  0.7
        Los Angeles     4000000  1.1
Canada  Toronto         3000000  0.5
        Vancouver       2500000  0.4
        Montreal        1800000  0.3